In [45]:
import pandas as pd
import numpy as np

# Data Collection

In [46]:
df = pd.read_csv('./Salary_Data.csv')
df.sample(10)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
3535,30.0,Male,Master's Degree,Web Developer,4.0,65000.0
4123,29.0,Male,Bachelor's Degree,Software Developer,5.0,80000.0
5032,36.0,Male,Bachelor's Degree,Sales Manager,11.0,160000.0
6452,32.0,Female,Bachelor's Degree,Director of Marketing,8.0,80000.0
5497,31.0,Male,Bachelor's Degree,Software Engineer,7.0,120000.0
3508,26.0,Female,Bachelor's Degree,Junior Web Developer,2.0,45000.0
5462,26.0,Female,Bachelor's Degree,Graphic Designer,2.0,50000.0
4954,26.0,Male,Bachelor's Degree,Senior Product Marketing Manager,5.0,85000.0
3255,42.0,Male,Master's Degree,Product Manager,14.0,180000.0
2033,32.0,Female,Master's Degree,Full Stack Engineer,6.0,115000.0

# Data Preparation

**ตรวจสอบข้อมูลเบื้องต้น**
---

In [47]:
df.shape

(6704, 6)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

In [49]:
df.describe()

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

**Missing Value**
---

In [50]:
# เช็คว่ามี Missing Value ไหม
df.isna().sum()

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [51]:
df.dropna(inplace=True) #นำข้อมูลที่มี Missing value ออก

In [52]:
df.isnull().sum() #Missing Value หายไปแล้ว

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

**ตรวจสอบประเภทของข้อมูล**
----

In [53]:
df["Gender"].value_counts().reset_index()

   Gender  count
0    Male   3671
1  Female   3013
2   Other     14

In [54]:
df["Job Title"].value_counts().reset_index()

                      Job Title  count
0             Software Engineer    518
1                Data Scientist    453
2     Software Engineer Manager    376
3                  Data Analyst    363
4       Senior Project Engineer    318
..                          ...    ...
186             Account Manager      1
187           Help Desk Analyst      1
188  Senior Training Specialist      1
189         Junior Web Designer      1
190    Software Project Manager      1

[191 rows x 2 columns]

In [55]:
df["Education Level"].value_counts().reset_index()

     Education Level  count
0  Bachelor's Degree   2265
1    Master's Degree   1572
2                PhD   1368
3         Bachelor's    756
4        High School    448
5           Master's    288
6                phD      1

In [60]:
# จะเห็นว่า
# Master's Degree == Master's
# PhD == phD

# เอา
df.replace("phD", "PhD", inplace=True)
df.replace("Master's", "Master's Degree", inplace=True)

In [61]:
df["Education Level"].value_counts().reset_index()

     Education Level  count
0  Bachelor's Degree   2265
1    Master's Degree   1860
2                PhD   1369
3         Bachelor's    756
4        High School    448